-- phpMyAdmin SQL Dump
-- version 3.5.5
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Фев 18 2013 г., 14:07
-- Версия сервера: 5.0.96-community-log
-- Версия PHP: 5.2.9

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `wwwiling_ildb`
--

-- --------------------------------------------------------

--
-- Структура таблицы `certificate`
--

CREATE TABLE IF NOT EXISTS `certificate` (
  `id` int(11) NOT NULL auto_increment,
  `date` timestamp NOT NULL default CURRENT_TIMESTAMP,
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `student_id` int(5) NOT NULL,
  `school_groups_id` int(5) NOT NULL,
  `img` varchar(150) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=6 ;

--
-- Дамп данных таблицы `certificate`
--

INSERT INTO `certificate` (`id`, `date`, `name`, `student_id`, `school_groups_id`, `img`) VALUES
(4, '2012-07-18 14:54:22', 'db_scheme2', 32, 19, 'db_scheme2.pdf'),
(3, '2012-07-18 14:51:36', 'db_scheme1', 31, 18, 'db_scheme1.pdf');

-- --------------------------------------------------------

--
-- Структура таблицы `classroom`
--

CREATE TABLE IF NOT EXISTS `classroom` (
  `id` int(5) NOT NULL auto_increment,
  `group_format_id` int(5) NOT NULL default '1',
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `description` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=7 ;

--
-- Дамп данных таблицы `classroom`
--

INSERT INTO `classroom` (`id`, `group_format_id`, `name`, `description`) VALUES
(1, 1, 'Alli Azure', ''),
(2, 1, 'Deep Purple', ''),
(3, 2, 'Yellow Submarine', ''),
(4, 1, 'The Vert', ''),
(5, 1, 'Lemon Tree', ''),
(6, 1, 'White House', '');

-- --------------------------------------------------------

--
-- Структура таблицы `groups`
--

CREATE TABLE IF NOT EXISTS `groups` (
  `id` mediumint(8) unsigned NOT NULL auto_increment,
  `name` varchar(20) collate utf8_unicode_ci NOT NULL,
  `description` varchar(100) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `groups`
--

INSERT INTO `groups` (`id`, `name`, `description`) VALUES
(1, 'admin', 'Administrator'),
(2, 'members', 'General User'),
(3, 'teachers', ''),
(4, 'managers', '');

-- --------------------------------------------------------

--
-- Структура таблицы `group_format`
--

CREATE TABLE IF NOT EXISTS `group_format` (
  `id` int(5) NOT NULL auto_increment,
  `name` varchar(50) collate utf8_unicode_ci NOT NULL,
  `description` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=5 ;

--
-- Дамп данных таблицы `group_format`
--

INSERT INTO `group_format` (`id`, `name`, `description`) VALUES
(1, 'Индивидуальная', ''),
(2, 'Малая (3-5 чел.)', ''),
(3, 'Средняя (5-7 чел)', ''),
(4, 'Большая (10-15 чел)', '');

-- --------------------------------------------------------

--
-- Структура таблицы `lang`
--

CREATE TABLE IF NOT EXISTS `lang` (
  `id` int(5) NOT NULL auto_increment,
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `short_name` varchar(5) collate utf8_unicode_ci NOT NULL,
  `color` varchar(7) collate utf8_unicode_ci NOT NULL default '#E93030',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=11 ;

--
-- Дамп данных таблицы `lang`
--

INSERT INTO `lang` (`id`, `name`, `short_name`, `color`) VALUES
(1, 'Английский', 'En', '#00aeff'),
(2, 'Немецкий', 'De', '#01c20f'),
(3, 'Французский', 'Fr', '#e92f30'),
(4, 'Итальянский', 'It', '#6739a5'),
(5, 'Испанский', 'Es', '#e6ac00'),
(7, 'Польский', 'Pl', '#40807f'),
(8, 'Русский', 'Ru', '#543018'),
(9, 'Китайский', 'Zh', '#888888'),
(10, 'Чешский', 'Cs', '#00baa5');

-- --------------------------------------------------------

--
-- Структура таблицы `level`
--

CREATE TABLE IF NOT EXISTS `level` (
  `id` int(5) NOT NULL auto_increment,
  `name` varchar(20) collate utf8_unicode_ci NOT NULL,
  `descriptiion` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=7 ;

--
-- Дамп данных таблицы `level`
--

INSERT INTO `level` (`id`, `name`, `descriptiion`) VALUES
(1, 'A1', ''),
(2, 'A2', ''),
(3, 'B1', ''),
(4, 'B2', ''),
(5, 'C1', ''),
(6, 'C2', '');

-- --------------------------------------------------------

--
-- Структура таблицы `log`
--

CREATE TABLE IF NOT EXISTS `log` (
  `id` int(11) NOT NULL auto_increment,
  `users_id` int(5) NOT NULL,
  `time` timestamp NOT NULL default CURRENT_TIMESTAMP,
  `message` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `notice`
--

CREATE TABLE IF NOT EXISTS `notice` (
  `id` int(11) NOT NULL auto_increment,
  `from_user_id` int(5) NOT NULL,
  `to_user_id` int(5) NOT NULL,
  `time` timestamp NOT NULL default CURRENT_TIMESTAMP on update CURRENT_TIMESTAMP,
  `message` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `payment`
--

CREATE TABLE IF NOT EXISTS `payment` (
  `id` int(11) NOT NULL auto_increment,
  `student_id` int(6) NOT NULL,
  `users_id` int(5) NOT NULL,
  `school_groups_id` int(11) default NULL,
  `summ` decimal(8,2) NOT NULL,
  `date` timestamp NOT NULL default CURRENT_TIMESTAMP,
  `comment` varchar(255) collate utf8_unicode_ci default NULL,
  `cnt_lessons` int(11) default NULL,
  `period_date_start` timestamp NOT NULL default '0000-00-00 00:00:00',
  `period_date_stop` timestamp NOT NULL default '0000-00-00 00:00:00',
  `payment_to` varchar(150) collate utf8_unicode_ci NOT NULL,
  `not_full` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=82 ;

--
-- Дамп данных таблицы `payment`
--

INSERT INTO `payment` (`id`, `student_id`, `users_id`, `school_groups_id`, `summ`, `date`, `comment`, `cnt_lessons`, `period_date_start`, `period_date_stop`, `payment_to`, `not_full`) VALUES
(68, 47, 1, 28, 235.00, '2012-10-30 22:00:00', '', 7, '2012-11-04 22:00:00', '2012-11-25 22:00:00', 'За обучение', 0),
(69, 43, 2, 22, 430.00, '2012-10-30 22:00:00', '', 9, '2012-10-31 22:00:00', '2012-11-28 22:00:00', 'За обучение', 0),
(70, 43, 2, 22, 430.00, '2012-10-30 22:00:00', 'sdgsdgsds', 9, '2012-10-31 22:00:00', '2012-11-28 22:00:00', 'За обучение', 0),
(71, 43, 1, 28, 430.00, '2012-10-30 22:00:00', 'sdgsdgsds', 9, '2012-10-31 22:00:00', '2012-11-28 22:00:00', 'За обучение', 0),
(72, 43, 2, 22, 520.00, '2012-10-30 22:00:00', '', 9, '2012-10-31 22:00:00', '2012-11-28 22:00:00', 'За обучение', 0),
(73, 66, 1, 31, 600.00, '2012-10-30 22:00:00', '', 10, '2012-10-30 22:00:00', '2012-12-02 22:00:00', 'За обучение', 0),
(74, 40, 2, 24, 450.00, '2012-12-10 22:00:00', 'тест', 9, '2012-11-01 22:00:00', '2012-11-29 22:00:00', 'За обучение', 0),
(75, 40, 1, 24, 450.00, '2012-11-30 22:00:00', 'тест', 8, '2012-12-03 22:00:00', '2012-12-27 22:00:00', 'За обучение', 0),
(76, 40, 1, 24, 250.00, '2012-12-26 22:00:00', 'тест', 9, '2012-12-31 22:00:00', '2013-01-28 22:00:00', 'За обучение', 1),
(77, 56, 1, 30, 1500.00, '2012-12-10 22:00:00', '', 45, '2012-12-11 22:00:00', '2013-03-24 22:00:00', 'За обучение', 1),
(78, 45, 1, 28, 405.00, '2012-12-10 22:00:00', '', 9, '2012-12-02 22:00:00', '2012-12-30 22:00:00', 'За обучение', 0),
(81, 71, 1, 22, 2150.00, '2013-02-17 22:00:00', '', 26, '2013-02-14 22:00:00', '2013-05-13 21:00:00', 'За обучение', 1),
(80, 45, 1, 28, 405.00, '2012-02-01 22:00:00', '', 8, '2013-02-03 22:00:00', '2013-02-27 22:00:00', 'За обучение', 1),
(62, 23, 1, 25, 350.00, '2012-10-25 21:00:00', '', 6, '2012-10-29 22:00:00', '2012-11-16 22:00:00', 'За обучение', 0),
(63, 23, 1, 25, 420.00, '2012-10-25 21:00:00', '', 27, '2012-10-26 21:00:00', '2013-01-25 22:00:00', 'За обучение', 0),
(64, 23, 1, 25, 420.00, '2012-10-26 21:00:00', '', 8, '2012-10-26 21:00:00', '2012-11-19 22:00:00', 'За обучение', 0),
(79, 45, 1, 28, 405.00, '2012-12-27 22:00:00', '', 9, '2013-01-02 22:00:00', '2013-01-30 22:00:00', 'За обучение', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `school_groups`
--

CREATE TABLE IF NOT EXISTS `school_groups` (
  `id` int(6) NOT NULL auto_increment,
  `name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `lang_id` int(5) NOT NULL,
  `level_id` int(5) NOT NULL,
  `group_format_id` int(5) NOT NULL,
  `status` int(3) NOT NULL,
  `start_lesson_date` timestamp NOT NULL default CURRENT_TIMESTAMP,
  `stop_lesson_date` timestamp NOT NULL default '0000-00-00 00:00:00',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=33 ;

--
-- Дамп данных таблицы `school_groups`
--

INSERT INTO `school_groups` (`id`, `name`, `lang_id`, `level_id`, `group_format_id`, `status`, `start_lesson_date`, `stop_lesson_date`) VALUES
(31, 'Индивидуал', 4, 1, 1, 0, '2012-10-31 18:59:57', '0000-00-00 00:00:00'),
(21, 'De интенсив лето 17:10', 2, 1, 2, 1, '2012-10-07 21:00:00', '2012-10-26 21:00:00'),
(28, '17:30 Общий А1', 1, 1, 2, 1, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(27, 'Карусельки', 1, 2, 2, 404, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(26, 'Викинги', 5, 2, 2, 404, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(25, 'Липки', 3, 4, 2, 404, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(29, 'Intensive A1', 1, 1, 2, 1, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(22, 'Bella Trio', 4, 1, 2, 1, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(23, 'крякозяблики', 9, 1, 2, 404, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(24, 'Interm 17', 1, 3, 2, 1, '2012-10-29 22:00:00', '0000-00-00 00:00:00'),
(15, 'Индивидуал', 2, 1, 1, 0, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(16, 'Индивидуал', 9, 1, 1, 0, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(17, 'Индивидуал', 8, 1, 1, 0, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(18, 'Индивидуал', 8, 1, 1, 0, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(19, 'Индивидуал', 8, 1, 1, 0, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(20, 'test 02', 9, 1, 2, 404, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(30, 'Intensive A2', 1, 1, 2, 1, '2012-10-30 19:11:01', '0000-00-00 00:00:00'),
(32, 'Индивидуал', 1, 1, 1, 0, '2012-12-06 13:56:49', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `school_groups_users`
--

CREATE TABLE IF NOT EXISTS `school_groups_users` (
  `id` int(6) NOT NULL auto_increment,
  `school_groups_id` int(5) NOT NULL,
  `users_id` int(5) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=60 ;

--
-- Дамп данных таблицы `school_groups_users`
--

INSERT INTO `school_groups_users` (`id`, `school_groups_id`, `users_id`) VALUES
(1, 6, 2),
(2, 6, 5),
(3, 6, 3),
(4, 7, 7),
(5, 7, 3),
(6, 7, 7),
(7, 10, 2),
(8, 10, 7),
(9, 10, 7),
(10, 11, 2),
(11, 11, 6),
(12, 12, 4),
(13, 12, 5),
(14, 11, 10),
(15, 4, 11),
(16, 11, 13),
(17, 13, 7),
(18, 13, 3),
(19, 13, 4),
(20, 14, 13),
(21, 14, 13),
(22, 10, 14),
(23, 15, 14),
(24, 15, 13),
(25, 16, 14),
(26, 16, 14),
(27, 17, 14),
(28, 17, 14),
(29, 18, 14),
(30, 18, 14),
(31, 19, 14),
(32, 19, 14),
(33, 20, 13),
(34, 20, 14),
(35, 21, 15),
(36, 22, 13),
(37, 23, 14),
(38, 23, 15),
(39, 23, 16),
(40, 24, 19),
(41, 24, 20),
(42, 25, 14),
(43, 25, 15),
(44, 26, 18),
(45, 26, 15),
(46, 26, 14),
(47, 26, 18),
(48, 22, 21),
(49, 27, 13),
(50, 27, 15),
(51, 27, 17),
(52, 28, 22),
(53, 28, 23),
(54, 29, 23),
(55, 30, 24),
(56, 31, 21),
(57, 31, 23),
(58, 32, 24),
(59, 32, 24);

-- --------------------------------------------------------

--
-- Структура таблицы `student`
--

CREATE TABLE IF NOT EXISTS `student` (
  `id` int(6) NOT NULL auto_increment,
  `fio` varchar(255) collate utf8_unicode_ci NOT NULL,
  `fio_name` varchar(150) collate utf8_unicode_ci NOT NULL,
  `fio_sname` varchar(150) collate utf8_unicode_ci NOT NULL,
  `fio_mname` varchar(150) collate utf8_unicode_ci NOT NULL,
  `mail` varchar(50) collate utf8_unicode_ci default NULL,
  `phone` varchar(50) collate utf8_unicode_ci NOT NULL,
  `address` varchar(255) collate utf8_unicode_ci default NULL,
  `birthday` timestamp NULL default '0000-00-00 00:00:00',
  `status` int(3) default NULL,
  `comment` text collate utf8_unicode_ci,
  `business_info` varchar(255) collate utf8_unicode_ci default NULL,
  `from_know` varchar(150) collate utf8_unicode_ci default NULL,
  `discount` int(2) default NULL,
  `date` timestamp NOT NULL default '0000-00-00 00:00:00',
  `status_id` int(5) default NULL,
  `test_lesson` timestamp NULL default '0000-00-00 00:00:00',
  `info_obj` text collate utf8_unicode_ci,
  `star` varchar(3) collate utf8_unicode_ci NOT NULL default 'off',
  `delete` varchar(15) collate utf8_unicode_ci NOT NULL default 'live',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=72 ;

--
-- Дамп данных таблицы `student`
--

INSERT INTO `student` (`id`, `fio`, `fio_name`, `fio_sname`, `fio_mname`, `mail`, `phone`, `address`, `birthday`, `status`, `comment`, `business_info`, `from_know`, `discount`, `date`, `status_id`, `test_lesson`, `info_obj`, `star`, `delete`) VALUES
(1, '1 Шевченко Александр Александрович', '', '', '', 'skybee84@yandex.ru', '066-150-80-25', 'пр-т. Победы 48-а', '2009-01-15 22:00:00', NULL, 'Хороший студент', NULL, '1', 5, '2012-04-12 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(2, '2 Михайлов Андрей Юрьевич', '', '', '', 'skybee84@yandex.ru', '0661508025', 'ул. Анисовая 42', '2005-08-18 21:00:00', NULL, 'Знающий студент. Может быть направлен в группу с более высоким уровнем', NULL, '1', 0, '2012-04-13 21:00:00', NULL, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(3, '3 Михайлов Андрей Юрьевич', '', '', '', 'skybee84@yandex.ru', '0661508025', 'ул. Анисовая 42', '2012-04-14 20:01:00', NULL, 'Знающий студент. Может быть направлен в группу с более высоким уровнем', NULL, '1', 0, '2012-04-13 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'arhive'),
(4, '4 Михайлов Андрей Юрьевич', '', '', '', 'skybee84@yandex.ru', '0661508025', 'ул. Анисовая 42', '2012-04-14 20:02:09', NULL, 'Знающий студент. Может быть направлен в группу с более высоким уровнем', NULL, '1', 0, '2012-04-13 21:00:00', 1, '2012-03-31 21:00:00', NULL, 'off', 'arhive'),
(5, 'Лысенко Андрей Генадиевич', 'Андрей', 'Лысенко', 'Генадиевич', 'skybee84@yandex.ru', '0661508025', 'ул. Анисовая 42', '2005-08-18 21:00:00', NULL, 'Знающий студент. Может быть направлен в группу с более высоким уровнем', '', 'метро', 0, '2012-04-13 21:00:00', 1, '2012-04-02 21:00:00', NULL, 'off', 'delete'),
(6, '6 Михайлов Андрей Юрьевич', '', '', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', NULL, '2', 0, '2012-04-13 21:00:00', 1, '2012-04-02 21:00:00', NULL, 'on', 'arhive'),
(7, '7 Михайлов Андрей Юрьевич', '', '', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 0, '2012-04-13 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'arhive'),
(8, '8 Михайлов Андрей Юрьевич', '', '', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', NULL, '2', 0, '2012-04-13 21:00:00', 1, '2012-04-27 21:00:00', NULL, 'off', 'delete'),
(9, '9 Михайлов Андрей Юрьевич', '', '', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', NULL, '2', 0, '2012-04-13 21:00:00', 1, '2012-04-27 21:00:00', NULL, 'off', 'delete'),
(10, '10 Михайлов Андрей Юрьевич', '', '', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 0, '2012-04-13 21:00:00', 1, '2012-04-27 21:00:00', NULL, 'off', 'live'),
(11, 'Николаев Александр', '', '', '', '', '0956234578', '', '0000-00-00 00:00:00', NULL, '', NULL, '1', 0, '2012-04-20 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(12, 'Николаев Александр', '', '', '', '', '0956234578', '', '0000-00-00 00:00:00', NULL, '', NULL, '1', 0, '2012-04-20 21:00:00', NULL, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(13, 'Николаев Александр', '', '', '', '', '0956234578', '', '0000-00-00 00:00:00', NULL, '', NULL, '1', 0, '2012-04-20 21:00:00', NULL, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(14, 'Петренко Иван Антонавич', '', '', '', '', '0579580245', '', '0000-00-00 00:00:00', NULL, '', NULL, '1', 0, '2012-04-21 21:00:00', NULL, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(15, 'Максименко Иван Антонавич', '', '', '', '', '0579580245', 'ул. Ивановская 12-б', '2012-04-25 21:00:00', NULL, '', NULL, '2', 20, '2012-04-21 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(16, 'Павликов Михаил Иванович', '', '', '', 'sdf@mail.ru', '0669214566', 'ул. Магаданская 18', '0000-00-00 00:00:00', NULL, '', NULL, '2', 10, '2012-04-22 21:00:00', NULL, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(23, 'Цукерка Алена Васильевна', '', '', '', '', '0631256415', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-05-29 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"2";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:1:"2";s:11:"prefer_lang";s:2:"Ge";s:11:"schedule_ar";a:3:{i:1;s:8:"17:30:00";i:3;s:8:"18:00:00";i:5;s:8:"17:00:00";}}', 'off', 'delete'),
(22, 'Николаенко Кирил Артемович', '', '', '', '', '0953082217', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-05-29 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"2";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:1:"2";s:11:"prefer_lang";s:2:"En";s:11:"schedule_ar";a:3:{i:1;s:8:"17:00:00";i:2;s:8:"17:30:00";i:4;s:8:"17:30:00";}}', 'off', 'delete'),
(19, 'Максименко Андрей Павлович', '', '', '', '', '0503084571', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-04-26 21:00:00', 1, '2012-04-13 21:00:00', NULL, 'off', 'delete'),
(20, 'Петренко Николай Алексеевич', '', '', '', '', '0991502021', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-05-29 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"3";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:1:"2";s:11:"prefer_lang";s:1:"2";s:11:"schedule_ar";a:4:{i:1;s:8:"18:00:00";i:3;s:8:"18:00:00";i:5;s:8:"16:30:00";i:7;s:8:"18:30:00";}}', 'off', 'delete'),
(21, 'Василенеко Андрей Генадиевич', '', '', '', '', '308226512', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-05-29 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"3";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:4:"2:30";s:11:"prefer_lang";s:2:"Es";s:11:"schedule_ar";a:3:{i:1;s:8:"17:00:00";i:3;s:8:"16:30:00";i:5;s:8:"17:00:00";}}', 'off', 'live'),
(24, 'Василенко Артем Андреевич', 'Артем', 'Василенко', 'Андреевич', '', '0661598023', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-06-04 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(25, 'Петренко Генадий Андреевич', 'Генадий', 'Петренко', 'Андреевич', 'skybee@meta.ua', '0501507832', 'ул. Калужная 9', '2009-09-17 21:00:00', NULL, 'Мавзик ватерноп амбилака дерабе примп. Аля бры.', NULL, 'интернет', 0, '2012-07-02 21:00:00', 1, '2012-07-13 21:00:00', NULL, 'on', 'delete'),
(26, 'Понин Вася Петрович', 'Вася', 'Понин', 'Петрович', '', '0924578615', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-02 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(27, 'Валик Стас Гаврилович', 'Стас', 'Валик', 'Гаврилович', '', '0661507832', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-02 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"4";s:11:"lesson_form";s:1:"1";s:13:"lesson_length";s:1:"2";s:11:"prefer_lang";s:2:"Es";s:11:"schedule_ar";a:3:{i:1;s:8:"00:00:00";i:4;s:8:"00:00:00";i:7;s:8:"00:00:00";}}', 'off', 'delete'),
(28, 'Николенко Александр Викторович', 'Александр', 'Николенко', 'Викторович', 'sderty@mail.ru', '0923162215', 'ул. Светлая 17', '1997-01-15 22:00:00', NULL, 'Молодец!', NULL, 'метро', 0, '2012-07-05 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(29, 'Сирко Андрей Викторович', 'Андрей', 'Сирко', 'Викторович', 'sderty@ua.com', '0932173216', 'пр-т. Свободы 48, кв. 52', '1988-05-19 20:00:00', NULL, '', NULL, 'интернет', 0, '2012-07-08 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(30, 'Ванько Андрей Генадиевич', 'Андрей', 'Ванько', 'Генадиевич', '', '05031822333', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-08 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'arhive'),
(31, 'Ванько Андрей Генадиевич', 'Андрей', 'Ванько', 'Генадиевич', '', '05031822333', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-08 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(32, 'Ванько Андрей Генадиевич', 'Андрей', 'Ванько', 'Генадиевич', '', '05031822333', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-08 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'on', 'delete'),
(33, 'Аксёнова Алина Юрьевна', 'Алина', 'Аксёнова', 'Юрьевна', '', '0507293710', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-03-13 22:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(34, 'Макушенко Марина Тимуровна', 'Марина', 'Макушенко', 'Тимуровна', '', '0633827406', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-06-04 21:00:00', 1, '2012-06-05 21:00:00', NULL, 'off', 'delete'),
(35, 'Кравченко Марина Вячеславовна', 'Марина', 'Кравченко', 'Вячеславовна', '', '0989350797', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-04-17 21:00:00', 1, '2012-06-05 21:00:00', NULL, 'off', 'delete'),
(36, 'Скорик Анна Леонидовна', 'Анна', 'Скорик', 'Леонидовна', '', '0675735740', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-03-26 21:00:00', 1, '2012-06-05 21:00:00', NULL, 'off', 'delete'),
(37, 'Петренко Алексай Ифакович', 'Алексай', 'Петренко', 'Ифакович', '', '0509582345', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-07-17 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"1";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:4:"2:30";s:11:"prefer_lang";s:2:"Es";s:11:"schedule_ar";a:2:{i:1;s:8:"16:00:00";i:4;s:8:"17:00:00";}}', 'off', 'delete'),
(38, 'Микуленко Андрей ', 'Андрей', 'Микуленко', '', '', '0661508025', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-08-24 21:00:00', 1, '2012-08-16 21:00:00', NULL, 'on', 'delete'),
(39, 'Борозняк Игорь Сергеевич', 'Игорь', 'Борозняк', 'Сергеевич', 'keennyy@gmail.com', '0997596982', 'Елизарова 11 кв 90', '2012-10-16 21:00:00', NULL, 'Труляля', NULL, 'интернет', 10, '2012-10-26 21:00:00', 1, '2012-10-10 21:00:00', NULL, 'off', 'delete'),
(40, 'Жулева Анна ', 'Анна', 'Жулева', '', '', '050 144 54 28', '', '0000-00-00 00:00:00', NULL, '', NULL, 'интернет', 0, '2012-09-04 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(41, 'Донец Ольгая Валерьевна', 'Ольгая', 'Донец', 'Валерьевна', '', '063 296 66 06', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 10, '2012-08-30 21:00:00', 0, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(45, 'Донец Елена ', 'Елена', 'Донец', '', '', '097 37 69 580', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 3, '2012-09-11 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(42, 'Шмыголь Владислава ', 'Владислава', 'Шмыголь', '', '', '093 430 85 90', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 10, '2012-09-04 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(43, 'Венгрен Дарья ', 'Дарья', 'Венгрен', '', '', '097 43 03 068', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-11 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(44, 'Нестерова Юлия ', 'Юлия', 'Нестерова', '', '', '063 64 61 720', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-09 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(46, 'Явтушенко Виктория ', 'Виктория', 'Явтушенко', '', '', '095 63 168 59', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-10 21:00:00', 1, '2012-09-12 21:00:00', NULL, 'off', 'live'),
(47, 'Берковская Елена ', 'Елена', 'Берковская', '', '', '095 800 92 96', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 0, '2012-10-09 21:00:00', 1, '2012-10-10 21:00:00', NULL, 'on', 'arhive'),
(48, 'Яцюк Егор ', 'Егор', 'Яцюк', '', '', '067 120 73 03', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-09 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(49, 'Муса Муджахид ', 'Муджахид', 'Муса', '', '', '093 528 23 02', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-11 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(50, 'Манна Мохаммед ', 'Мохаммед', 'Манна', '', '', '050 55 888 18', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-11 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(51, 'Мельников Илья ', 'Илья', 'Мельников', '', '', '066 615 54 23', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 0, '2012-10-12 21:00:00', 0, '2012-10-15 21:00:00', NULL, 'off', 'live'),
(68, 'Мельников Илья ', 'Илья', 'Мельников', '', '', '80666155423 ', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-12-05 22:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(52, 'Завада Олег ', 'Олег', 'Завада', '', '', '099 487 06 28', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-08-06 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(53, 'Голубев Борис ', 'Борис', 'Голубев', '', '', '050 609 52 35', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-08-19 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'on', 'live'),
(54, 'Ткачук Евгения Александровна', 'Евгения', 'Ткачук', 'Александровна', '', '097 244 68 66', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-17 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(55, 'Карасенко Алексей ', 'Алексей', 'Карасенко', '', '', '067 596 40 12', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-25 21:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'live'),
(56, 'Глазуновская Юлия Александровна', 'Юлия', 'Глазуновская', 'Александровна', '', '066 768 90 96', '', '0000-00-00 00:00:00', NULL, '', '', 'метро', 0, '2012-09-23 21:00:00', 0, '2012-09-05 21:00:00', NULL, 'off', 'live'),
(67, 'Мельников  Илья ', 'Илья', 'Мельников ', '', '', '066 615 54 23 ', '', '0000-00-00 00:00:00', NULL, '', NULL, 'интернет', 0, '2012-10-12 21:00:00', 3, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"2";s:11:"lesson_form";s:1:"1";s:13:"lesson_length";s:1:"1";s:11:"prefer_lang";s:2:"En";s:11:"schedule_ar";a:2:{i:2;s:8:"17:30:00";i:4;s:8:"17:30:00";}}', 'off', 'live'),
(57, 'Золотарев Сергей ', 'Сергей', 'Золотарев', '', '', '095 84 25 190', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-04-18 21:00:00', 1, '2012-06-05 21:00:00', NULL, 'off', 'live'),
(58, 'Срибный Дмитрий Олегович', 'Дмитрий', 'Срибный', 'Олегович', '', '098 55 95 110', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-08-30 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(59, 'Дереза Эдуард ', 'Эдуард', 'Дереза', '', '', '093 023 89 84', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-02 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'on', 'live'),
(66, 'Бурочкин Григорий Александрович', 'Григорий', 'Бурочкин', 'Александрович', 'bor@mail.ru', '0503652524', 'пер. Куралесино, 8', '1989-10-11 21:00:00', NULL, 'Хороший студент', NULL, 'интернет', 10, '2012-10-30 22:00:00', 1, '0000-00-00 00:00:00', NULL, 'off', 'delete'),
(60, 'Нагорный Антон ', 'Антон', 'Нагорный', '', '', '050 54 27 898', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-02 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(61, 'Змитрович Денис ', 'Денис', 'Змитрович', '', '', '066 160 82 67', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-09 21:00:00', 1, '2012-09-13 21:00:00', NULL, 'off', 'live'),
(62, 'Спасова Александра ', 'Александра', 'Спасова', '', '', '093 408 85 80', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-03 21:00:00', 1, '2012-09-20 21:00:00', NULL, 'off', 'live'),
(63, 'Гончаров Александр ', 'Александр', 'Гончаров', '', '', '098 933 47 82', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-09-04 21:00:00', 1, '2012-09-12 21:00:00', NULL, 'off', 'live'),
(64, 'Турчина Ольга ', 'Ольга', 'Турчина', '', '', '050 402 10 22', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-03-02 22:00:00', 1, '2012-09-17 21:00:00', NULL, 'off', 'live'),
(65, 'Тестовый Михаил Абрамович', 'Михаил', 'Тестовый', 'Абрамович', '', '380661508025', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2012-10-29 22:00:00', 1, '0000-00-00 00:00:00', 'O:11:"info_db_lib":5:{s:12:"count_lesson";s:1:"2";s:11:"lesson_form";s:1:"2";s:13:"lesson_length";s:1:"2";s:11:"prefer_lang";s:2:"En";s:11:"schedule_ar";a:2:{i:3;s:8:"16:00:00";i:6;s:8:"16:00:00";}}', 'off', 'delete'),
(69, 'Митракова Наталья ', 'Наталья', 'Митракова', '', '', '050 010 01 44 ', '', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 10, '2012-11-28 22:00:00', 1, '2012-11-29 22:00:00', NULL, 'off', 'live'),
(70, 'Подопытный  Хомяк Бобрович', 'Хомяк', 'Подопытный ', 'Бобрович', 'skybee84@yandex.ru', '0661508025', 'ул. Кирова 2б', '1997-05-15 21:00:00', NULL, 'Пушистый', NULL, 'метро', 10, '2013-02-17 22:00:00', 1, '2013-02-14 22:00:00', NULL, 'off', 'delete'),
(71, '!Пдопытный Хомяк_2 Бобрович', 'Хомяк_2', '!Пдопытный', 'Бобрович', 'skybee84@yandex.ru', '0661508025', 'ул. Якира 8', '0000-00-00 00:00:00', NULL, '', NULL, 'метро', 0, '2013-02-17 22:00:00', 1, '2013-02-13 22:00:00', NULL, 'off', 'live');

-- --------------------------------------------------------

--
-- Структура таблицы `student_school_groups`
--

CREATE TABLE IF NOT EXISTS `student_school_groups` (
  `id` int(8) NOT NULL auto_increment,
  `student_id` int(6) NOT NULL,
  `school_groups_id` int(5) NOT NULL,
  `test_lesson` timestamp NOT NULL default '0000-00-00 00:00:00',
  `start_lesson_date` timestamp NOT NULL default '0000-00-00 00:00:00',
  `start_pause` timestamp NOT NULL default '0000-00-00 00:00:00',
  `stop_pause` timestamp NOT NULL default '0000-00-00 00:00:00',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=155 ;

--
-- Дамп данных таблицы `student_school_groups`
--

INSERT INTO `student_school_groups` (`id`, `student_id`, `school_groups_id`, `test_lesson`, `start_lesson_date`, `start_pause`, `stop_pause`) VALUES
(103, 46, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(2, 3, 3, '0000-00-00 00:00:00', '2012-04-27 13:33:21', '2012-04-27 13:32:48', '2012-04-27 13:32:57'),
(3, 4, 3, '0000-00-00 00:00:00', '2012-04-27 13:33:21', '2012-04-27 13:32:48', '2012-04-27 13:32:57'),
(149, 47, 29, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 6, 1, '0000-00-00 00:00:00', '2012-04-27 13:33:21', '2012-04-27 13:32:48', '2012-04-27 13:32:57'),
(6, 7, 1, '0000-00-00 00:00:00', '2012-04-27 13:33:21', '2012-04-27 13:32:48', '2012-04-27 13:32:57'),
(107, 48, 24, '0000-00-00 00:00:00', '2012-09-13 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(129, 59, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(33, 10, 1, '0000-00-00 00:00:00', '2012-05-24 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(38, 10, 3, '0000-00-00 00:00:00', '2012-05-16 21:00:00', '2012-06-27 21:00:00', '2012-06-29 21:00:00'),
(39, 10, 2, '0000-00-00 00:00:00', '2012-05-23 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(128, 58, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(127, 57, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(100, 42, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(131, 62, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(106, 49, 24, '2012-09-13 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(43, 21, 10, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(44, 7, 11, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(45, 21, 11, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(99, 45, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(102, 44, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(124, 61, 29, '2012-09-13 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(126, 56, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(108, 50, 24, '2012-09-13 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(147, 29, 21, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(118, 55, 29, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(150, 68, 32, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(116, 53, 29, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(98, 41, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(146, 25, 21, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(145, 11, 21, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(154, 71, 22, '2013-02-13 22:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(132, 63, 30, '2012-09-12 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(115, 52, 29, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(152, 53, 24, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(104, 47, 28, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(90, 40, 24, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(117, 54, 29, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(151, 69, 24, '2012-11-29 22:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(133, 64, 30, '2012-09-17 21:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(130, 60, 30, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(142, 61, 27, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(143, 57, 27, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(144, 49, 27, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(148, 64, 21, '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Структура таблицы `student_status`
--

CREATE TABLE IF NOT EXISTS `student_status` (
  `id` int(5) NOT NULL auto_increment,
  `default` tinyint(1) NOT NULL,
  `in_list` tinyint(1) NOT NULL default '1',
  `name` varchar(50) collate utf8_unicode_ci NOT NULL,
  `sort` int(3) NOT NULL default '10',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=6 ;

-- --------------------------------------------------------

--
-- Структура таблицы `teacher_lang`
--

CREATE TABLE IF NOT EXISTS `teacher_lang` (
  `id` int(10) NOT NULL auto_increment,
  `user_id` int(5) NOT NULL,
  `lang_id` int(5) NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=40 ;

--
-- Дамп данных таблицы `teacher_lang`
--

INSERT INTO `teacher_lang` (`id`, `user_id`, `lang_id`) VALUES
(1, 2, 1),
(2, 2, 2),
(3, 3, 3),
(4, 3, 4),
(5, 4, 2),
(6, 5, 5),
(7, 6, 4),
(8, 7, 1),
(9, 7, 3),
(10, 7, 4),
(26, 19, 1),
(39, 29, 2),
(38, 28, 2),
(31, 22, 1),
(32, 23, 1),
(33, 24, 1),
(34, 25, 2),
(35, 26, 2),
(36, 27, 2);

-- --------------------------------------------------------

--
-- Структура таблицы `timetable_changes`
--

CREATE TABLE IF NOT EXISTS `timetable_changes` (
  `id` int(11) NOT NULL auto_increment,
  `timetable_set_id` int(11) NOT NULL,
  `change_date` date NOT NULL,
  `new_date` date NOT NULL,
  `classroom_id` int(4) NOT NULL,
  `school_groups_id` int(5) NOT NULL,
  `user_id` int(5) NOT NULL,
  `day` int(1) NOT NULL,
  `time_start` time NOT NULL,
  `time_stop` time NOT NULL,
  `cancel` varchar(10) collate utf8_unicode_ci NOT NULL default 'no',
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=311 ;

--
-- Дамп данных таблицы `timetable_changes`
--

INSERT INTO `timetable_changes` (`id`, `timetable_set_id`, `change_date`, `new_date`, `classroom_id`, `school_groups_id`, `user_id`, `day`, `time_start`, `time_stop`, `cancel`) VALUES
(307, 69, '2012-12-10', '2012-12-10', 6, 30, 24, 1, '18:30:00', '20:00:00', 'no'),
(308, 73, '2012-12-31', '2012-12-31', 4, 28, 23, 1, '11:30:00', '13:00:00', 'no'),
(305, 66, '2012-12-10', '2012-12-10', 2, 29, 20, 1, '17:00:00', '19:00:00', 'no'),
(298, 78, '2012-12-04', '2012-12-04', 4, 32, 24, 2, '19:00:00', '20:00:00', 'no'),
(285, 73, '2012-10-29', '2012-10-29', 6, 28, 23, 1, '16:30:00', '18:00:00', 'no'),
(284, 69, '2012-10-29', '2012-10-29', 6, 30, 24, 1, '19:00:00', '20:30:00', 'no'),
(288, 73, '2012-11-05', '2012-11-05', 6, 28, 23, 1, '11:00:00', '12:30:00', 'no'),
(296, 66, '2012-12-03', '2012-12-03', 5, 29, 23, 1, '18:00:00', '19:30:00', 'no'),
(293, 79, '2012-12-06', '2012-12-06', 5, 32, 24, 4, '17:30:00', '18:30:00', 'no'),
(273, 54, '2012-10-30', '2012-10-30', 6, 24, 21, 2, '17:00:00', '18:30:00', 'no');

-- --------------------------------------------------------

--
-- Структура таблицы `timetable_set`
--

CREATE TABLE IF NOT EXISTS `timetable_set` (
  `id` int(11) NOT NULL auto_increment,
  `classroom_id` int(5) NOT NULL,
  `school_groups_id` int(5) NOT NULL,
  `user_id` int(5) NOT NULL,
  `day` int(1) NOT NULL,
  `time_start` time NOT NULL,
  `time_stop` time NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=83 ;

--
-- Дамп данных таблицы `timetable_set`
--

INSERT INTO `timetable_set` (`id`, `classroom_id`, `school_groups_id`, `user_id`, `day`, `time_start`, `time_stop`) VALUES
(69, 6, 30, 24, 1, '19:00:00', '20:30:00'),
(68, 1, 29, 23, 5, '19:00:00', '20:30:00'),
(67, 1, 29, 23, 3, '19:00:00', '20:30:00'),
(66, 5, 29, 23, 1, '19:00:00', '20:30:00'),
(65, 1, 28, 22, 4, '19:00:00', '20:30:00'),
(73, 6, 28, 23, 1, '16:30:00', '18:00:00'),
(55, 6, 24, 19, 5, '17:00:00', '19:00:00'),
(54, 6, 24, 21, 2, '17:00:00', '18:30:00'),
(82, 4, 22, 22, 5, '18:00:00', '19:30:00'),
(81, 1, 22, 29, 2, '16:00:00', '17:30:00'),
(80, 5, 27, 22, 2, '18:30:00', '20:30:00'),
(79, 5, 32, 24, 4, '17:30:00', '18:30:00'),
(30, 3, 21, 24, 5, '17:00:00', '18:30:00'),
(29, 2, 21, 22, 3, '17:30:00', '19:00:00'),
(28, 5, 21, 23, 2, '13:30:00', '15:00:00'),
(78, 5, 32, 24, 2, '17:30:00', '18:30:00'),
(70, 6, 30, 24, 3, '19:00:00', '20:30:00'),
(71, 6, 30, 24, 5, '19:00:00', '20:30:00');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` mediumint(8) unsigned NOT NULL auto_increment,
  `ip_address` int(10) unsigned NOT NULL,
  `username` varchar(100) collate utf8_unicode_ci NOT NULL,
  `password` varchar(40) collate utf8_unicode_ci NOT NULL,
  `salt` varchar(40) collate utf8_unicode_ci default NULL,
  `email` varchar(100) collate utf8_unicode_ci NOT NULL,
  `activation_code` varchar(40) collate utf8_unicode_ci default NULL,
  `forgotten_password_code` varchar(40) collate utf8_unicode_ci default NULL,
  `remember_code` varchar(40) collate utf8_unicode_ci default NULL,
  `created_on` int(11) unsigned NOT NULL,
  `last_login` int(11) unsigned default NULL,
  `active` tinyint(1) unsigned default NULL,
  `fio` varchar(255) collate utf8_unicode_ci default NULL,
  `fio_name` varchar(100) collate utf8_unicode_ci NOT NULL,
  `fio_sname` varchar(100) collate utf8_unicode_ci NOT NULL,
  `fio_mname` varchar(100) collate utf8_unicode_ci NOT NULL,
  `name` varchar(150) collate utf8_unicode_ci NOT NULL default 'Антон',
  `company` varchar(100) collate utf8_unicode_ci default NULL,
  `phone` varchar(20) collate utf8_unicode_ci default NULL,
  `address` varchar(200) collate utf8_unicode_ci NOT NULL,
  `comment` varchar(255) collate utf8_unicode_ci NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=30 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `ip_address`, `username`, `password`, `salt`, `email`, `activation_code`, `forgotten_password_code`, `remember_code`, `created_on`, `last_login`, `active`, `fio`, `fio_name`, `fio_sname`, `fio_mname`, `name`, `company`, `phone`, `address`, `comment`) VALUES
(1, 2130706433, 'administrator', '59beecdf7fc966e2f17fd8f65a4a9aeb09d4a3d4', '9462e8eee0', 'admin@admin.com', '', NULL, NULL, 1268889823, 1268889823, 1, 'Admin', '', '', '', 'Антон', 'ADMIN', '0', '', ''),
(19, 0, '', '', NULL, '', NULL, NULL, NULL, 0, NULL, NULL, 'Стародубцева Елизавета ', 'Елизавета', 'Стародубцева', '', 'Антон', NULL, '099 235 26 04', '', ''),
(28, 0, '', '', NULL, 'y-la@mail.ru', NULL, NULL, NULL, 0, NULL, NULL, 'Куринова Юлия Вячеславовна', 'Юлия', 'Куринова', 'Вячеславовна', 'Антон', NULL, '0637603357', '', ''),
(29, 0, '', '', NULL, 'y-la@mail.ru', NULL, NULL, NULL, 0, NULL, NULL, 'Куринова Юлия Вячеславовна', 'Юлия', 'Куринова', 'Вячеславовна', 'Антон', NULL, '0930000000', '', ''),
(22, 0, '', '', NULL, '', NULL, NULL, NULL, 0, NULL, NULL, 'Лихожон Оксана ', 'Оксана', 'Лихожон', '', 'Антон', NULL, '066 83 17 967', '', ''),
(23, 0, '', '', NULL, '', NULL, NULL, NULL, 0, NULL, NULL, 'Ибрагимова Сура ', 'Сура', 'Ибрагимова', '', 'Антон', NULL, '099 050 19 96', '', ''),
(24, 0, '', '', NULL, '', NULL, NULL, NULL, 0, NULL, NULL, 'Ковтуненко Ольга ', 'Ольга', 'Ковтуненко', '', 'Антон', NULL, '097 93 92 034', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `users_groups`
--

CREATE TABLE IF NOT EXISTS `users_groups` (
  `id` mediumint(8) unsigned NOT NULL auto_increment,
  `user_id` mediumint(8) unsigned NOT NULL,
  `group_id` mediumint(8) unsigned NOT NULL,
  PRIMARY KEY  (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=31 ;

--
-- Дамп данных таблицы `users_groups`
--

INSERT INTO `users_groups` (`id`, `user_id`, `group_id`) VALUES
(1, 1, 1),
(2, 1, 2),
(3, 2, 3),
(4, 3, 3),
(5, 4, 3),
(6, 5, 3),
(7, 6, 3),
(8, 7, 3),
(9, 8, 3),
(10, 9, 3),
(11, 10, 3),
(12, 11, 3),
(13, 12, 3),
(14, 13, 3),
(15, 14, 3),
(16, 15, 3),
(17, 16, 3),
(18, 17, 3),
(19, 18, 3),
(20, 19, 3),
(21, 20, 3),
(22, 21, 3),
(23, 22, 3),
(24, 23, 3),
(25, 24, 3),
(26, 25, 3),
(27, 26, 3),
(28, 27, 3),
(29, 28, 3),
(30, 29, 3);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
